{
    "name": "BONNY BABU",
    "title": "Robotics Engineer",
    "favicon": "assets/images/BB.png",
    "favicon_type": "png",
    "image_path": "/assets/images/profile_pic.png",
    "resume": "/resume.pdf",
    "contact": {
        "email": "bonnybabukachappilly@gmail.com",
        "phone": "+91 8589973392",
        "portfolio_url": "https://bonnybabukachappilly.github.io",
        "location": {
            "current": "Bangalore, Karnataka, India",
            "home": "Ernakulam, Kerala, India"
        }
    },
    "summary": "I am a Robotics Engineer with expertise in ROS 2, simulation, and motion planning. My experience includes industrial automation, control systems, and real-time data integration. Additionally, I have a strong background in PLC programming, embedded systems, and electrical engineering. Passionate about innovation and problem-solving, I thrive in cross-disciplinary teams and am always eager to learn and explore new technologies.",
    "portfolio": "I am a Robotics Engineer specializing in ROS 2, simulation, and motion planning, with expertise in industrial automation, control systems, and real-time data integration.",
    "social": [
        {
            "label": "Gmail",
            "icon": "envelope-at",
            "url": "mailto:bonnybabukachappilly@gmail.com"
        },
        {
            "label": "Linkedin",
            "icon": "linkedin",
            "url": "https://www.linkedin.com/in/bonnybabukachappilly"
        },
        {
            "label": "Github",
            "icon": "github",
            "url": "https://www.github.com/bonnybabukachappilly"
        }
    ],
    "work_experience": [
        {
            "company": "Simelabs - Digital, AI, Metaverse, Robotics, VLSI",
            "position": "Robotics Engineer",
            "start_date": "May 2021",
            "end_date": "Present",
            "location": "Ernakulam, Kerala, India",
            "highlights": [
                "Programmed ABB Yumi, Gofa, and Omron TM5 robots for three assembly cells in SmartDose Flex Automation.",
                "Developed modular PLC function blocks and integrated EtherNet/IP for seamless robot-cell communication.",
                "Assisted in PLC-vision system communication using TCP sockets for real-time object detection and validation.",
                "Optimized robotic motion, reducing cycle time and improving efficiency in automated assembly processes.",
                "Leveraged Adapter & Factory design patterns for scalable and maintainable robotics software development.",
                "Designed middleware bridging ROS 2 DDS and WebSockets for real-time robot monitoring in Sime-World.",
                "Configured TurtleBot 3 and built a realistic simulation environment for navigation testing.",
                "Implemented sensor fusion techniques to enhance localization accuracy and improve path planning.",
                "Implemented real-time video streaming for patient monitoring in VitalCAM.",
                "Developed test automation for ISave, a ventilator-sharing device, with automated test execution and reporting."
            ]
        },
        {
            "company": "Path BEE Engineers and Contractors",
            "position": "MEP Design Engineer (Electrical)",
            "start_date": "January 2020",
            "end_date": "April 2021",
            "location": "Ernakulam, Kerala, India",
            "highlights": [
                "Designed and maintained electrical single-line diagrams (SLDs) and layouts using AutoCAD software.",
                "Conducted site supervision ensuring design implementation and compliance with safety regulations.",
                "Managed procurement activities and supervised operations for government projects.",
                "Performed load calculations and equipment selection to optimize electrical system performance.",
                "Developed and reviewed technical documentation, including schematics, BOMs.",
                "Troubleshot and resolved electrical issues during installation and commissioning phases.",
                "Ensured regulatory compliance by adhering to national and international electrical standards."
            ]
        }
    ],
    "education": [
        {
            "course": "Bachelor of Technology [EEE]",
            "institution": "College of Engineering, Aranmula",
            "year": "2020",
            "university": "APJ Abdul Kalam Technological University"
        },
        {
            "course": "Diploma of Education in MEP",
            "institution": "MTTC International LLC",
            "year": "2019",
            "university": "STED Council"
        }
    ],
    "projects": [
        {
            "name": "SmartDose Flex Automation",
            "client": "West Pharma",
            "duration": "January 2023 - Present",
            "description": "Automated the SmartDose assembly line using robotics, digital twin technologies, and real-time monitoring.",
            "tasks": [
                "Led robotics programming for ABB Yumi & Gofa, and Omron TM5, focusing on 3 out of 6 assembly cells, ensuring seamless robot motion and process execution.",
                "Developed PLC function blocks for EtherNet/IP-based ABB integration, standardizing communication across all cells for improved modularity and scalability.",
                "Implemented TCP socket communication for vision system integration, enhancing real-time object detection and quality control.",
                "Optimized robotic workflows and debugging, identifying inefficiencies and suggesting mechanical design improvements to enhance system reliability.",
                "Leveraged Adapter & Factory design patterns to create a scalable software blueprint, ensuring consistency and reusability across the robotics and PLC programming teams."
            ]
        },
        {
            "name": "Sime-World",
            "client": "In-House Project",
            "duration": "July 2022 - December 2022",
            "description": "Developed an Autonomous Mobile Robot (AMR) using TurtleBot 3 and ROS 2.",
            "tasks": [
                "Designed a middleware to bridge ROS 2 DDS and WebSockets, enabling seamless frontend integration with ROS.",
                "Configured TurtleBot 3 for real-world navigation and testing.",
                "Assisted in creating a realistic simulation environment for TurtleBot to operate in.",
                "Integrated sensor fusion techniques to improve localization and navigation accuracy.",
                "Supported electronics integration within the simulated world, ensuring accurate sensor-actuator interactions."
            ]
        },
        {
            "name": "VitalCAM",
            "client": "AI-Med",
            "duration": "-",
            "description": "Implemented real-time video streaming for patient monitoring, ensuring secure transmission and optimizing performance for seamless remote access.",
            "tasks": [
                "Designed a middleware to bridge ROS 2 DDS and WebSockets, enabling seamless frontend integration with ROS.",
                "Configured TurtleBot 3 for real-world navigation and testing.",
                "Assisted in creating a realistic simulation environment for TurtleBot to operate in.",
                "Integrated sensor fusion techniques to improve localization and navigation accuracy.",
                "Supported electronics integration within the simulated world, ensuring accurate sensor-actuator interactions."
            ]
        },
        {
            "name": "ISave Test Automation",
            "client": "AI-Med",
            "duration": "-",
            "description": "Implemented test automation for ISave, a ventilator-sharing device, ensuring reliable performance and efficient multi-patient usage validation.",
            "tasks": [
                "Automated manual testing by processing pre-formatted Excel sheets as test case inputs.",
                "Generated automated test reports in Excel, reducing manual effort and improving accuracy.",
                "Integrated Appium with Android-based systems, enabling seamless communication for testing Isave and the test ventilator.",
                "Developed UI using Kivy for test execution and monitoring.",
                "Used Python for scripting and implemented background Shell scripts to connect Android devices via ADB."
            ]
        }
    ],
    "skills": [
        {
            "name": "Robotics System & Automation",
            "keywords": [
                "Robotic Manipulators",
                "ABB Yumi & Gofa",
                "TM5",
                "HMI",
                "PLC",
                "Robotic Manipulators",
                "Collaborative Robots"
            ]
        },
        {
            "name": "Simulation & Design",
            "keywords": [
                "RViz",
                "RobotStudio",
                "RoboDK",
                "MoveIt",
                "Gazebo",
                "AutoCAD",
                "Fusion 360"
            ]
        },
        {
            "name": "Programming & Development",
            "keywords": [
                "Python",
                "ROS 2",
                "ROS 1",
                "PLC Programming",
                "ABB RAPID Programming",
                "TM Flow Programming",
                "Sysmac Studio"
            ]
        },
        {
            "name": "Embedded Systems & Hardware",
            "keywords": [
                "Raspberry PI",
                "Arduino",
                "Nvidia Jetson",
                "Motor Control",
                "Sensor Integration"
            ]
        },
        {
            "name": "Soft Skills",
            "keywords": [
                "Self-motivated",
                "Problem-solving",
                "Multitasking",
                "Team Collaboration",
                "Communicative",
                "Adaptability",
                "Critical Thinking"
            ]
        }
    ],
    "accomplishments": [
        "Mentored junior engineers in ABB and PLC programming, accelerating onboarding.",
        "Integrated MQTT-based IoT data publishing for predictive maintenance and real-time monitoring.",
        "Developed a ROS-based semi-digital twin with RViz for real-time robot diagnostics.",
        "Optimized robotic path planning, cutting cycle time from 2m 30s to under 1m.",
        "Designed modular PLC function blocks for reusable, maintainable automation logic.",
        "Enabled cell-wise testing in robots without PLC for independent validation.",
        "Introduced dry-run capability to ensure process reliability before deployment."
    ]
}